In [ ]:
#activity 3.8.1

In [124]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input
password = getpass.getpass()

········

In [4]:
#connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
#engine = create_engine(connection_string)

In [125]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
engine = create_engine(connection_string)

In [ ]:
#activity 3.8.2

In [141]:
query = '''select account_id, type, operation from trans'''

In [139]:
query

'select account_id, type, operations from trans'

In [142]:
data = pd.read_sql(query, engine)

In [143]:
data.head()

   account_id    type operation
0        2378  PRIJEM     VKLAD
1         576  PRIJEM     VKLAD
2         704  PRIJEM     VKLAD
3        3818  PRIJEM     VKLAD
4        1972  PRIJEM     VKLAD

In [147]:
cross1 =  pd.crosstab(data['type'], data['operation'], rownames=['type'], colnames=['operation'])

In [148]:
cross1.head()

operation          PREVOD NA UCET  PREVOD Z UCTU   VKLAD   VYBER  VYBER KARTOU
type
PRIJEM     183112               0          41214  115624       0             0
VYBER           0               0              0       0   14092             0
VYDAJ           0          129484              0       0  377811          6682

In [48]:
query1 = '''select loan_id, account_id
from bank.loan'''

In [145]:
df2 = pd.read_sql(query1, engine)

In [146]:
df2.head()

   loan_id  account_id
0     5314        1787
1     5316        1801
2     6863        9188
3     5325        1843
4     7240       11013

In [149]:
query3 = 'select t1.account_id, t1.type, t1.operation, t2.loan_id from trans as t1 inner join loan as t2 on t1.account_id = t2.account_id'
                         
df3 = pd.read_sql(query3,connection_string)
df3.head()

   account_id    type      operation  loan_id
0        5270  PRIJEM  PREVOD Z UCTU     6077
1       11265  PRIJEM          VKLAD     7284
2       10364  PRIJEM          VKLAD     7121
3        3834  PRIJEM          VKLAD     5754
4        9307  PRIJEM          VKLAD     6895

In [150]:
pd.crosstab(df3['type'], df3['operation'], rownames=['type'], colnames=['operation'])

operation         PREVOD NA UCET  PREVOD Z UCTU  VKLAD  VYBER  VYBER KARTOU
type
PRIJEM     31337               0           5336  22633      0             0
VYBER          0               0              0      0   5347             0
VYDAJ          0           25796              0      0  64842           790

In [ ]:
#activity 3.8.3

In [ ]:
query4 = '''select account_id, type, operation from trans'''

In [ ]:
df4 =

In [ ]:
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [ ]:
sns.distplot(df3['t_amount'])
plt.show()